Repository: xperseguers/t3ext-ig_ldap_sso_auth
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: it

# mlang_labels_tabdescr
source: LDAP management and configuration module.
it: Modulo di gestione e configurazione LDAP.

# mlang_labels_tablabel
source: LDAP management
it: Gestione LDAP

# title
source: LDAP / SSO service management
it: Gestione servizio LDAP / SSO

# configuration_missing.title
source: No Configuration Records
it: Nessun elemento di configurazione

# configuration_missing.message
source: This module cannot be used until you create at least one configuration record. Please refer to the <a href="%s" target="_blank">administrator manual</a> for further information.<br /><br /><a href="%s">Click here</a> to create a configuration record.
it: Questo modulo non può essere utilizzato a meno che non venga creato un elemento di configurazione. Per ulteriori informazioni fai riferimento al &lt;a href="%s" target="_blank"&gt;manuale per l'amministratore&lt;/a&gt;.&lt;br /&gt;&lt;br /&gt;&lt;a href="%s"&gt;Fai clic qui&lt;/a&gt; per creare un elemento di configurazione.

# module_docheader.configurations.switch
source: Switch configuration
it: Cambia configurazione

# module_docheader.configurations.edit
source: Edit current configuration
it: Modifica la configurazione corrente

# module_overview
source: Overview
it: Panoramica

# module_status
source: Status
it: Stato

# module_status.title.domains
source: Domains
it: Domini

# module_status.description.domains
source: Current LDAP configuration is restricted to following domain(s):
it: La configurazione LDAP corrente è limitata ai seguenti domini:

# module_status.messages.ldapDisable
source: LDAP is disabled since the host name is undefined.
it: LDAP è disabilitato poiché non è stato definito il nome dell'host.

# module_status.messages.enabled
source: enabled
it: abilitato

# module_status.messages.disabled
source: disabled
it: disabilitato

# module_status.messages.empty
source: none
it: nessuno

# module_status.title.connection
source: Connection status
it: Stato della connessione

# module_status.title.frontend
source: Frontend authentication
it: Autenticazione per il frontend

# module_status.title.backend
source: Backend authentication
it: Autenticazione per il backend

# module_status.configuration.server
source: Server type
it: Tipo di server

# module_status.configuration.charset
source: Character set
it: Set di caratteri

# module_status.configuration.tls
source: Use TLS
it: Usa TLS

# module_status.configuration.ssl
source: Use SSL
it: Usa SSL

# module_status.configuration.connect
source: LDAP connect
it: Connessione LDAP

# module_status.configuration.LDAPAuthentication
source: LDAP authentication
it: Autenticazione LDAP

# module_status.configuration.forceLowerCaseUsername
source: Convert user name to lower-case
it: Converti il nome utente in minuscolo

# module_status.configuration.evaluateGroupsFromMembership
source: Extract groups from membership attribute
it: Estrai i gruppi dall'attributo membership

# module_status.configuration.IfUserExist
source: User must exist already
it: L'utente deve esistere già

# module_status.configuration.IfGroupExist
source: User group must exist already
it: Il gruppo di utenti deve esistere già

# module_status.configuration.BEfailsafe
source: Local (non-LDAP) users may authenticate
it: Gli utenti locali (non LDAP) possono essere autenticati

# module_status.configuration.updateAdminAttribForGroups
source: User groups promoted as TYPO3 administrators
it: Gruppi di utenti promossi ad amministratori di TYPO3

# module_status.configuration.DeleteUserIfNoTYPO3Groups
source: Delete user if not in any TYPO3 user groups
it: Elimina l'utente se non appartiene ad alcun gruppo di utenti TYPO3

# module_status.configuration.DeleteUserIfNoLDAPGroups
source: Delete user if not in any LDAP user groups
it: Elilmina l'utente se non appartiene ad alcun gruppo di utenti LDAP

# module_status.configuration.GroupsNotSynchronize
source: Prevent synchronization of user groups
it: Impedisci la sincronizzazione dei gruppi di utenti

# module_status.configuration.assignGroups
source: Additional TYPO3 user groups assigned
it: Gruppi di utenti TYPO3 aggiuntivi

# module_status.configuration.keepTYPO3Groups
source: Keep locally-assigned TYPO3 user groups
it: Mantieni i gruppi di utenti TYPO3 assegnati localmente

# module_status.configuration.requiredLDAPGroups
source: Required LDAP user groups to validate authentication
it: Gruppi di utenti LDAP richiesti per validare l'autenticazione

# module_status.configuration.users
source: Configuration for users
it: Configurazione degli utenti

# module_status.configuration.groups
source: Configuration for user groups
it: Configurazione dei gruppi di utenti

# module_search
source: Search wizard
it: Ricerca guidata

# module_search_type
source: Type
it: Tipo

# module_search_type.frontendUsers
source: Frontend users
it: Utenti di Frontend

# module_search_type.frontendUserGroups
source: Frontend user groups
it: Gruppi di utenti di Frontend

# module_search_type.backendUsers
source: Backend users
it: Utenti di Backend

# module_search_type.backendUserGroups
source: Backend user groups
it: Gruppi di utenti di Backend

# module_search_options
source: Options
it: Opzioni

# module_search_options.firstEntry
source: First entry only
it: Solo la prima entry

# module_search_options.status
source: Show status
it: Mostra stato

# module_search_filter
source: Filter
it: Filtro

# module_search.action.search
source: search
it: cerca

# module_search_status
source: LDAP search status
it: Stato della ricerca LDAP

# module_search_result
source: Result
it: Risultato

# module_search_noResult
source: No results
it: Nessun risultato

# module_search_preview
source: Preview mapping
it: Anteprima mappatura

# module_import.action.import
source: import
it: importa

# module_import.action.update
source: update
it: aggiorna

# module_import.action.undelete
source: undelete
it: annulla l'eliminazione

# module_import_users_fe
source: Import LDAP users (Frontend)
it: Importa utenti LDAP (Frontend)

# module_import_users_be
source: Import LDAP users (Backend)
it: Importa utenti LDAP (Backend)

# module_import_users.empty
source: No users found.
it: Nessun utente trovato.

# module_import_users.caption_local
source: LDAP user is available locally
it: L'utente LDAP è disponibile localmente

# module_import_users.caption_deleted
source: LDAP user has been imported but then manually deleted
it: L'utente LDAP è stato importato ma in seguito eliminato manualmente

# module_import.field.name
source: Name
it: Nome

# module_import_groups_fe
source: Import LDAP groups (Frontend)
it: Importa gruppi LDAP (Frontend)

# module_import_groups_be
source: Import LDAP groups (Backend)
it: Importa gruppi LDAP (Backend)

# module_import_groups.empty
source: No groups found.
it: Nessun gruppo trovato.

# module_import_groups.caption_local
source: LDAP group is available locally
it: Il gruppo LDAP è disponibile localmente

# module_import_groups.caption_deleted
source: LDAP group has been imported but then manually deleted
it: Il gruppo LDAP è stato importato ma in seguito eliminato manualmente
