Repository: xperseguers/t3ext-ig_ldap_sso_auth
Catalog: Resources/Private/Language/*.locallang_csh_db.xlf
Languages: da, de, fr, it, nl

# name.description
source: Name used to distinguish each configuration.
da: Navn der bruges til at skelne mellem hver konfiguration.
de: Name, um jede Konfiguration zu unterscheiden.
fr: Nom utilisé afin de distinguer chaque configuration.
it: Nome usato per distinguere ogni configurazione.
nl: Naam gebruikt on elke configuratie te kunnen herkennen

# domains.description
source: Domains for which this configuration should be used. Leave empty to use it with any domain.
de: Domains, für die die Konfiguration verwendet werden soll. Leer lassen, um sie mit jeder Domain zu verwenden.
it: Domini per i quali questa configurazione deve essere usata. Lascia vuoto questo campo per utilizzarla con qualsiasi dominio.
nl: Domeinen waarvoor deze configuratie gebruikt moet worden. Veld leeg laten om met elk domein te kunnen gebruiken.

# ldap_charset.description
source: Character set used by the LDAP server. Usually: utf-8.
da: Karaktersæt brugt af LDAP-serveren. Sædvanligvis: utf- 8.
de: Zeichensatz, der vom LDAP verwendet wird. Standard: utf-8.
fr: Jeu de caractères utilisé par le serveur LDAP. Par défaut : utf-8.
it: Set di caratteri usato dal server LDAP. Di solito: utf-8.
nl: Tekenset gebruikt door de LDAP server. Standaard: utf-8.

# ldap_host.description
source: Address of the LDAP server.
de: Adresse des LDAP Dienstes.
it: Indirizzo del server LDAP.
nl: Adres van de LDAP server.

# ldap_port.description
source: Port used by the LDAP server. Default: 389.
da: Port brugt af LDAP-serveren. Standard: 389.
de: Port, der vom LDAP Dienst verwendet wird. Standard: 389.
fr: Port utilisé par le serveur LDAP. Par défaut : 389.
it: Porta usata dal server LDAP. Impostazione predefinita: 389.
nl: Port gebruikt door LDAP server. Standaard: 389.

# ldap_binddn.description
source: DN (Distinguished Name) used to bind to the server.
da: DN (Distinguished Name) bruges til at forbinde til serveren.
de: DN (Distinguished Name), der für die Verbindung zum Server verwendet wird.
fr: DN (Distinguished Name) utilisé pour la connexion au serveur.
it: DN (Distinguished Name) utilizzato per il collegamento al server.
nl: DN (Distinguished Name) gebruikt voor de verbinding met de server.

# ldap_binddn.syntax
source: E.g., cn=admin,dc=example,dc=com
de: z.B.: cn=admin,dc=example,dc=com
fr: Ex.: cn=admin,dc=example,dc=com
it: Es. cn=admin,dc=example,dc=com
nl: Bijv. cn=admin,dc=example,dc=com

# ldap_password.description
source: Password used to bind to the server.
de: Passwort, das für die Verbindung zum Server verwendet wird.
it: Password utilizzata per il collegamento al server.
nl: Wachtwoord voor de verbinding met de server.

# be_users_basedn.description
source: DN (Distinguished Name) to be used to look for BE users in the LDAP server.
da: DN (Distinguished Name) der skal bruges til at slå BE-brugere op på LDAP-serveren.
de: DN (Distinguished Name), der für die Suche nach Backend-Benutzern im LDAP-Dienst verwendet wird.
fr: DN (Distinguished Name) de base pour la recherche des usagers BE sur le serveur LDAP.
it: DN (Distinguished Name) da utilizzare per la ricerca degli utenti di BE nel server LDAP.
nl: DN (Distinguished Name) om BE gebruikers te zoeken in de LDAP server.

# be_users_basedn.syntax
source: E.g., ou=USERS,dc=example,dc=com
de: z.B.: ou=USERS,dc=example,dc=com
fr: Ex.: ou=USERS,dc=example,dc=com
it: Es. ou=USERS,dc=example,dc=com
nl: Bijv. ou=USERS,dc=example,dc=com

# be_users_filter.description
source: Filter to search for BE users in the LDAP server.
da: Filtrer for at søge efter BE-brugere på LDAP-serveren.
de: Filter für die Suche nach Backend-Benutzern im LDAP-Dienst.
fr: Filtre de recherche des usagers BE sur le serveur LDAP.
it: Filtro per la ricerca degli utenti di BE nel server LDAP.
nl: Filter om te zoeken naar BE gebruikers in de LDAP server.

# be_users_filter.syntax
source: Sample of a filter used for the authentication: (cn={USERNAME})
de: Beispiel für einen Filter für die Authentifizierung: (cn={USERNAME})
fr: Exemple d'un filtre simple utilisé pour l'authentification : (cn={USERNAME})
it: Esempio di filtro usato per l'autenticazione: (cn={USERNAME})
nl: Voorbeel van een filter voor de authenticatie: (cn={USERNAME})

# be_users_mapping.description
source: Assign LDAP attribute to a field of the user record.
da: Tildel LDAP-attribut til et felt fra brugerelementet.
de: LDAP Attribut einem Feld des Benutzer-Datensatzes zuordnen.
fr: Assigner la valeur d'un attribut LDAP à un champ de la table de l'usager.
it: Assegna attributo LDAP a un campo della scheda utente.
nl: Koppel LDAP attribuut aan een veld in het record van de gebruiker.

# be_groups_basedn.description
source: DN (Distinguished Name) to be used to look for BE groups in the LDAP server.
da: DN (Distinguished Name) der skal bruges til at lede efter BE-grupper på LDAP-serveren.
de: DN (Distinguished Name), der für die Suche nach BE Gruppen im LDAP Dienst verwendet wird.
fr: DN (Distinguished Name) de base pour la recherche des groupes BE sur le serveur LDAP.
it: DN (Distinguished Name) da utilizzare per la ricerca dei gruppi di BE nel server LDAP.
nl: DN (Distinguished Name) gebruikt om te zoeken naar BE groepen in de LDAP server.

# be_groups_basedn.syntax
source: E.g., ou=GROUPS,dc=example,dc=com
de: z.B.: ou=GROUPS,dc=example,dc=com
fr: Ex.: ou=GROUPS,dc=example,dc=com
it: Es., ou=GROUPS,dc=example,dc=com
nl: Bijv. ou=GROUPS,dc=example,dc=com

# be_groups_filter.description
source: Filter to search for BE groups in the LDAP server. Example: (objectClass=posixGroup)
da: Filtrér for at søge efter BE grupper på LDAP-serveren. Eksempel: (objectClass=posixGroup)
de: Filter für die Suche nach Backend-Gruppen im LDAP Dienst. Beispiel: (objectClass=posixGroup)
fr: Filtre de recherche des groupes BE sur le serveur LDAP. Exemple: (objectClass=posixGroup)
it: Filtro per la ricerca dei gruppi di BE nel server LDAP. Ad esempio: (objectClass=posixGroup)
nl: Filter voor het zoeken naar BE groepen in de LDAP server. Voorbeeld: (objectClass=posixGroup)

# be_groups_filter.syntax
source: Sample if option "Relation between groups and users" is set to "Group contains the list of its members": (memberuid={USERDN})
de: Beispiel für die Option "Relation zwischen Gruppen und Benutzern" ist auf "Gruppe enthält die Liste ihrer Mitglieder" gesetzt: (memberuid={USERDN})
fr: Exemple si l'option "Relation entres les groupes et les utilisateurs" est définie à "L'utilisateur contient la liste des groupes associés" : (memberuid={USERDN})
nl: Voorbeeld als optie "Relatie tussen groepen en gebruikers" is ingesteld op "Groep bevat lijst met leden": (memberuid={USERDN})

# be_groups_mapping.description
source: Assign LDAP attribute to a field of the user group.
da: Tildel LDAP-attribut til et felt i brugergruppen.
de: LDAP Attribut zu einem Feld der Benutzergruppe zuordnen.
fr: Assigner la valeur d'un attribut LDAP à un champ de la table de l'usager.
it: Assegna attributo LDAP a un campo del gruppo di utenti.
nl: LDAP attribuut aan veld van gebruikersgroep toewijzen.

# be_groups_required.description
source: List of backend user groups (previously imported from LDAP) required to authorize authentication of LDAP users.
da: Liste over backend brugergrupper (tidligere importeret fra LDAP) som kræves for at godkende godkendelse af LDAP-brugere.
de: Liste der Backend-Benutzergruppen (ursprünglich aus LDAP importiert), die für die Authorisierung der LDAP Benutzer erforderlich sind.
fr: Liste de groupes utilisateurs backend (précédemment importés depuis LDAP) requis pour autoriser l'authentification d'utilisateurs LDAP.
it: Lista dei gruppi di utenti di backend (importati da LDAP in precedenza) richiesti per autorizzare l'autenticazione degli utenti LDAP.
nl: Lijst van backendgebruikers (eerder geïmporteerd uit LDAP) benodigd voor het authorizeren van de authenticatie van LDAP gebruikers.

# be_groups_assigned.description
source: List of backend user groups to be assigned automatically when authenticating LDAP users.
da: Liste over backend brugergrupper, der skal tildeles automatisk ved godkendelse af LDAP-brugere.
de: Liste der Backend-Benutzergruppen, die automatisch zugewiesen werden, wenn LDAP Benutzer authentifiziert werden.
fr: Liste de groupes utilisateurs backend à assigner lors de l'authentification d'utilisateurs LDAP.
it: Lista dei gruppi di utenti di backend da assegnare automaticamente in seguito all'autenticazione degli utenti LDAP.
nl: Lijst van backend gebruikersgroepen die automatisch toegewezen moeten worden bij het authenticeren van LDAP gebruikers.

# be_groups_admin.description
source: List of backend user groups whose members should be promoted as TYPO3 administrators (valid only as part of LDAP authentication).
da: Liste over backend brugergrupper, hvis medlemmer skal fremmes som TYPO3 administratorer (kun gyldig som en del af LDAP-godkendelse).
de: Liste der Backend-Benutzergruppen, deren Mitglieder TYPO3 Administratoren sein sollen (nur gültig als Teil der LDAP Authentifizierung).
fr: Liste de groupes utilisateurs backend dont les membres doivent être promus administrateurs TYPO3 (valable uniquement lors d'une authentication par LDAP).
it: Lista dei gruppi di utenti di backend i cui membri devono essere promossi ad amministratori TYPO3 (valido solo come parte della procedura di autenticazione LDAP).
nl: Lijst van backendgebruikersgroepen waarvan de leden in TYPO3 admin-rechten moeten krijgen (alleen geldig als onderdeel van LDAP authenticatie).

# fe_users_basedn.description
source: DN (Distinguished Name) to be used to look for FE users in the LDAP server.
da: DN (Distinguished Name) der skal bruges til at slå FE-brugere op på LDAP-serveren.
de: DN (Distinguished Name), der bei der Suche nach Frontend-Benutzern in dem LDAP Dienst verwendet wird.
fr: DN (Distinguished Name) de base pour la recherche des usagers FE sur le serveur LDAP.
it: DN (Distinguished Name) da utilizzare per la ricerca degli utenti di FE nel server LDAP.
nl: DN (Distinguished Name) te gebruiken bij het zoeken naar FE gebruikers in de LDAP server.

# fe_users_basedn.syntax
source: E.g., ou=USERS,dc=example,dc=com
de: z.B.: ou=USERS,dc=example,dc=com
fr: Ex.: ou=USERS,dc=example,dc=com
it: Es., ou=USERS,dc=example,dc=com
nl: Bijv. ou=USERS,dc=example,dc=com

# fe_users_filter.description
source: Filter to search for FE users in the LDAP server.
da: Filtrer for at søge efter FE brugere på LDAP- serveren.
de: Filter, der bei der Suche nach Frontend-Benutzern im LDAP-Dienst verwendet wird.
fr: Filtre de recherche des usagers FE sur le serveur LDAP.
it: Filtro per la ricerca degli utenti di FE nel server LDAP.
nl: Filter voor het zoeken naar FE gebruikers in de LDAP server.

# fe_users_filter.syntax
source: Sample of a filter used for the authentication: (cn={USERNAME})
de: Beispiel für einen FIlter, der bei der Authentifizierung verwendet wird: (cn={USERNAME})
fr: Exemple d'un filtre simple utilisé pour l'authentification : (cn={USERNAME})
it: Esempio di filtro usato per l'autenticazione: (cn={USERNAME})
nl: Voorbeeld van een filter voor authenticatie: (cn={USERNAME})

# fe_users_mapping.description
source: Assign LDAP attribute to a field of the user record.
da: Tildel LDAP-attribut til et felt fra brugerelementet.
de: LDAP Attribut einem Feld im Benutzerdatensatz zuweisen.
fr: Assigner la valeur d'un attribut LDAP à un champ de la table de l'usager.
it: Assegna attributo LDAP a un campo della scheda utente.
nl: Koppel LDAP attribuut aan een veld in het record van de gebruiker.

# fe_groups_basedn.description
source: DN (Distinguished Name) to be used to look for FE groups in the LDAP server.
da: DN (Distinguished Name) der skal bruges til at søge efter FE grupper på LDAP-serveren.
de: DN (Distinguished Name), der für die Suche nach FE Gruppen im LDAP Dienst verwendet wird.
fr: DN (Distinguished Name) de base pour la recherche des groupes FE sur le serveur LDAP.
it: DN (Distinguished Name) da utilizzare per la ricerca dei gruppi di FE nel server LDAP.
nl: DN (Distinguished Name) om te zoeken naar FE groepen in de LDAP server.

# fe_groups_basedn.syntax
source: E.g., ou=GROUPS,dc=example,dc=com
de: z.B.: ou=GROUPS,dc=example,dc=com
fr: Ex.: ou=GROUPS,dc=example,dc=com
it: Es., ou=GROUPS,dc=example,dc=com
nl: Bijv. ou=GROUPS,dc=example,dc=com

# fe_groups_filter.description
source: Filter to search for FE groups in the LDAP server. Example: (objectClass=posixGroup)
da: Filtrér for at søge efter FE-grupper på LDAP-serveren. Eksempel: (objectClass=posixGroup)
de: Filter, der für die Suche nach FE Gruppen im LDAP Dienst. Beispiel: (objectClass=posixGroup)
fr: Filtre de recherche des groupes FE sur le serveur LDAP. Exemple: (objectClass=posixGroup)
it: Filtro per la ricerca degli utenti di FE nel server LDAP. Esempio: (objectClass=posixGroup)
nl: Filter om te zoeken naar FE groepen in de LDAP server. Voorbeeld: (objectClass=posixGroup)

# fe_groups_filter.syntax
source: Sample if option "Relation between groups and users" is set to "Group contains the list of its members": (memberuid={USERDN})
de: Beispiel, falls die Option "Realtion zwischen Gruppen und Benutzern" auf "Gruppe enthält die Liste ihrer Mitglieder" gesetzt ist: (memberuid={USERDN})
fr: Exemple si l'option "Relation entres les groupes et les utilisateurs" est définie à "L'utilisateur contient la liste des groupes associés" : (memberuid={USERDN})
nl: Voorbeeld als de optie "Relatie tussen groepen en gebruikers" is ingesteld op "Groep bevat lijst van leden": (memberuid={USERDN})

# fe_groups_mapping.description
source: Assign LDAP attribute to a field of the group record.
da: Tildel LDAP-attribut til et felt fra gruppeelementet.
de: LDAP Attribut einem Feld des Gruppendatensatzes zuweisen:
fr: Assigner la valeur d'un attribut LDAP à un champ de la table de l'usager.
it: Assegna attributo LDAP a un campo della scheda del gruppo.
nl: Wijs LDAP attribuut toe aan een veld van het groep-record.

# fe_groups_required.description
source: List of frontend user groups (previously imported from LDAP) required to authorize authentication of LDAP users.
da: Liste over brugergrupper (tidligere importeret fra LDAP) der kræves for at godkende godkendelse af LDAP-brugere.
de: Liste der Frontend-Benutzergruppen (ursprl. aus LDAP importiert), die für die Authorisierung der LDAP Benutzer erforderlich ist.
fr: Liste de groupes utilisateurs frontend (précédemment importés depuis LDAP) requis pour autoriser l'authentification d'utilisateurs LDAP.
it: Lista dei gruppi degli utenti di frontend (importati da LDAP in precedenza) richiesti per autorizzare l'autenticazione degli utenti LDAP.
nl: Lijst van frontend gebruikersgroepen (eerder geïmporteerd uit LDAP) benodigd voor het authorizeren van de authenticatie van LDAP-gebruikers.

# fe_groups_assigned.description
source: List of frontend user groups to be assigned automatically when authenticating LDAP users.
da: Liste over brugergrupper, der skal tildeles automatisk ved godkendelse af LDAP-brugere.
de: Liste der Frontend-Benutzergruppen, die automatisch bei der Authentifizierung von LDAP Benutzern zugewiesen werden.
fr: Liste de groupes utilisateurs frontend à assigner lors de l'authentification d'utilisateurs LDAP.
it: Lista dei gruppi di utenti di frontend da assegnare automaticamente in seguito all'autenticazione degli utenti LDAP.
nl: Lijst van frontend gebruikersgroepen die automatisch toegewezen moeten worden biji het authenticeren van LDAP-gebruikers.

# ldap_server.description
source: Type of LDAP server used by the authentication (OpenLDAP, Active Directory).
da: Typen af LDAP-server, der bruges af autentificeringen (OpenLDAP, Active Directory).
fr: Type de serveur LDAP utilisé par l'authentification (OpenLDAP, Active Directory).
it: Tipo di server LDAP usato per l'autenticazione (OpenLDAP, Active Directory).
